export const temporarytimetable: { [key: string]: { [key: string]: { [key: string]: { date: string; period: string[]; subject: string[]; } } } } = {
  "20240304": {
    "1": {
      "1": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["체육", "통과", "정보", "국사", "국어", "음악"]
      },
      "2": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["음악", "음악", "체육", "영어", "수학", "정보"]
      },
      "3": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["국어", "영어", "진로", "국사", "통과", "수학"]
      },
      "4": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["통사", "정보", "실험", "수학", "체육", "영어"]
      },
      "5": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["영어", "통사", "통과", "국어", "진로", "수학"]
      },
      "6": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["미술", "미술", "통사", "수학", "한문", "통과"]
      },
      "7": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["통사", "체육", "국어", "통과", "영어", "국사"]
      },
      "8": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["국어", "한문", "수학", "영어", "미술", "미술"]
      },
      "9": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["국사", "영어", "통과", "통사", "수학", "체육"]
      },
      "10": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["영어", "국어", "수학", "체육", "통과", "한문"]
      },
      "11": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["진로", "통사", "한문", "국어", "영어", "국사"]
      }
    },
    "2": {
      "1": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["문학", "A/윤사", "P/미창", "P/미창", "영Ⅰ", "B/한지"]
      },
      "2": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["수Ⅰ", "A/한지", "운건", "N/일Ⅰ", "문학", "B/지Ⅰ"]
      },
      "3": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["O/일Ⅰ", "A/세계", "P/음연", "P/음연", "수Ⅰ", "B/생과"]
      },
      "4": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["영Ⅰ", "A/윤사", "진로", "수Ⅰ", "문학", "B/세계"]
      },
      "5": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["수Ⅰ", "A/정법", "문학", "영Ⅰ", "운건", "B/생과"]
      },
      "6": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["문학", "A/생과", "일Ⅰ", "수Ⅰ", "영Ⅰ", "B/윤사"]
      },
      "7": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["O/중Ⅰ", "A/생과", "수Ⅰ", "문학", "영Ⅰ", "B/물Ⅰ"]
      },
      "8": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["운건", "A/생Ⅰ", "문학", "N/중Ⅰ", "수Ⅰ", "B/화Ⅰ"]
      },
      "9": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["영Ⅰ", "A/화Ⅰ", "수Ⅰ", "운건", "문학", "B/생Ⅰ"]
      },
      "10": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["문학", "A/지Ⅰ", "영Ⅰ", "수Ⅰ", "일Ⅰ", "B/생Ⅰ"]
      },
      "11": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["영Ⅰ", "운건", "일Ⅰ", "한지", "수Ⅰ", "B/윤사"]
      }
    },
    "3": {
      "1": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/여지", "X/영미", "시민", "E/생Ⅱ", "H/합주", "영독"]
      },
      "2": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/인간", "X/미적", "확통", "E/생윤", "H/생Ⅱ", "스포"]
      },
      "3": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/사문", "X/고전", "V/화작", "E/인공", "H/여지", "시민"]
      },
      "4": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/생윤", "영독", "V/언매", "E/경제", "H/일문", "확통"]
      },
      "5": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/사탐", "확통", "영독", "E/동아", "H/융과", "미적"]
      },
      "6": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/화Ⅱ", "진로", "확통", "E/융과", "H/사탐", "고전"]
      },
      "7": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/지Ⅱ", "스포", "진로", "E/사탐", "H/인공", "확통"]
      },
      "8": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/프로", "화작", "고전", "E/여지", "H/사문", "영독"]
      },
      "9": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/생Ⅱ", "영독", "스포", "E/일회", "H/세지", "언매"]
      },
      "10": {
        date: "3월 4일 월요일",
        period: ["1", "2", "3", "4", "5", "6"],
        subject: ["F/일회", "고전", "영독", "E/인간", "H/생윤", "화작"]
      }
    }
  },
  "20240305": {
    "1": {
      "1": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["영어", "수학", "통과", "국사", "체육", "국어", "통사"]
      },
      "2": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["실험", "국사", "수학", "국어", "영어", "통사", "통과"]
      },
      "3": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["국어", "국사", "체육", "통사", "정보", "수학", "영어"]
      },
      "4": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["정보", "국어", "국어", "국사", "수학", "음악", "음악"]
      },
      "5": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["국사", "통사", "영어", "음악", "국어", "수학", "정보"]
      },
      "6": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["체육", "국어", "국사", "수학", "통과", "영어", "국사"]
      },
      "7": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["수학", "통과", "실험", "영어", "통사", "진로", "한문"]
      },
      "8": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["통과", "통사", "영어", "한문", "국사", "체육", "국어"]
      },
      "9": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["국어", "실험", "한문", "통과", "진로", "수학", "국사"]
      },
      "10": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["통사", "국사", "미술", "국어", "영어", "한문", "수학"]
      },
      "11": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["체육", "영어", "국어", "통사", "미술", "미술", "수학"]
      }
    },
    "2": {
      "1": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["문학", "일Ⅰ", "영Ⅰ", "I/프로", "A/윤사", "수Ⅰ", "C/화Ⅰ"]
      },
      "2": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["영Ⅰ", "진로", "수Ⅰ", "I/가정", "A/한지", "문학", "C/윤사"]
      },
      "3": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["수Ⅰ", "문학", "운건", "I/심영", "A/세계", "영Ⅰ", "C/윤사"]
      },
      "4": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["문학", "영Ⅰ", "R/미창", "R/미창", "A/윤사", "K/가정", "C/정법"]
      },
      "5": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["운건", "영Ⅰ", "일Ⅰ", "J/기하", "A/정법", "문학", "C/세계"]
      },
      "6": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["수Ⅰ", "진로", "문학", "J/현대", "A/생과", "영Ⅰ", "C/생Ⅰ"]
      },
      "7": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["진로", "운건", "수Ⅰ", "문학", "A/생과", "영Ⅰ", "C/생Ⅰ"]
      },
      "8": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["문학", "영Ⅰ", "R/음연", "R/음연", "A/생Ⅰ", "수Ⅰ", "C/지Ⅰ"]
      },
      "9": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["일Ⅰ", "M/현대", "수Ⅰ", "영Ⅰ", "A/화Ⅰ", "문학", "C/물Ⅰ"]
      },
      "10": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["영Ⅰ", "M/기하", "문학", "운건", "A/지Ⅰ", "수Ⅰ", "C/한지"]
      },
      "11": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["한지", "수Ⅰ", "영Ⅰ", "문학", "운건", "K/현대", "C/생과"]
      }
    },
    "3": {
      "1": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/영문", "U/언매", "E/생Ⅱ", "확통", "영독", "H/합주", "스포"]
      },
      "2": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/수탐", "U/화작", "E/생윤", "영독", "미적", "H/생Ⅱ", "확통"]
      },
      "3": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/프로", "확통", "E/인공", "V/화작", "진로", "H/여지", "영독"]
      },
      "4": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/사문", "영독", "E/경제", "V/언매", "확통", "H/일문", "영미"]
      },
      "5": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/가정", "영독", "E/동아", "스포", "시민", "H/융과", "W/화작"]
      },
      "6": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/생윤", "스포", "E/융과", "시민", "영독", "H/사탐", "W/언매"]
      },
      "7": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/합주", "화작", "E/사탐", "영독", "확통", "H/인공", "Z/미적"]
      },
      "8": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/사탐", "진로", "E/여지", "확통", "스포", "H/사문", "Z/고전"]
      },
      "9": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/평면", "확통", "E/일회", "고전", "언매", "H/세지", "영독"]
      },
      "10": {
        date: "3월 5일 화요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["G/일문", "시민", "E/인간", "스포", "화작", "H/생윤", "확통"]
      }
    }
  },
  "20240306": {
    "1": {
      "1": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["수학", "영어", "국어", "진로", "통사", "배움", "배움"]
      },
      "2": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["정보", "체육", "국사", "수학", "국어", "배움", "배움"]
      },
      "3": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["음악", "음악", "통과", "영어", "정보", "배움", "배움"]
      },
      "4": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["국어", "영어", "통사", "통과", "음악", "배움", "배움"]
      },
      "5": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["통과", "국어", "정보", "수학", "국사", "배움", "배움"]
      },
      "6": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["국사", "통사", "국어", "체육", "국어", "배움", "배움"]
      },
      "7": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["국사", "수학", "국어", "체육", "한문", "배움", "배움"]
      },
      "8": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["수학", "국어", "통과", "국사", "통사", "배움", "배움"]
      },
      "9": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["통사", "한문", "체육", "국어", "영어", "배움", "배움"]
      },
      "10": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["미술", "미술", "통사", "수학", "국어", "배움", "배움"]
      },
      "11": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["통사", "통과", "국사", "한문", "수학", "배움", "배움"]
      }
    },
    "2": {
      "1": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/화Ⅰ", "영Ⅰ", "수Ⅰ", "운건", "B/한지", "배움", "배움"]
      },
      "2": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/윤사", "수Ⅰ", "문학", "영Ⅰ", "B/지Ⅰ", "배움", "배움"]
      },
      "3": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/윤사", "진로", "영Ⅰ", "문학", "B/생과", "배움", "배움"]
      },
      "4": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/정법", "문학", "일Ⅰ", "수Ⅰ", "B/세계", "배움", "배움"]
      },
      "5": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/세계", "수Ⅰ", "영Ⅰ", "일Ⅰ", "B/생과", "배움", "배움"]
      },
      "6": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/생Ⅰ", "운건", "S/음연", "S/음연", "B/윤사", "배움", "배움"]
      },
      "7": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/생Ⅰ", "L/현대", "S/미창", "S/미창", "B/물Ⅰ", "배움", "배움"]
      },
      "8": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/지Ⅰ", "L/기하", "수Ⅰ", "영Ⅰ", "B/화Ⅰ", "배움", "배움"]
      },
      "9": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/물Ⅰ", "문학", "운건", "수Ⅰ", "B/생Ⅰ", "배움", "배움"]
      },
      "10": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/한지", "일Ⅰ", "영Ⅰ", "문학", "B/생Ⅰ", "배움", "배움"]
      },
      "11": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["C/생과", "수Ⅰ", "문학", "영Ⅰ", "B/윤사", "배움", "배움"]
      }
    },
    "3": {
      "1": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["영독", "G/영문", "언매", "F/여지", "확통", "D/생윤", "창A"]
      },
      "2": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["시민", "G/수탐", "진로", "F/인간", "스포", "D/사문", "창A"]
      },
      "3": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["확통", "G/프로", "스포", "F/사문", "고전", "D/사탐", "창A"]
      },
      "4": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["Y/영미", "G/사문", "영독", "F/생윤", "진로", "D/여지", "창A"]
      },
      "5": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["Y/미적", "G/가정", "확통", "F/사탐", "W/화작", "D/일회", "창A"]
      },
      "6": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["Y/고전", "G/생윤", "확통", "F/화Ⅱ", "W/언매", "D/중회", "창A"]
      },
      "7": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["스포", "G/합주", "영독", "F/지Ⅱ", "미적", "D/화Ⅱ", "창A"]
      },
      "8": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["화작", "G/사탐", "시민", "F/프로", "확통", "D/물Ⅱ", "창A"]
      },
      "9": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["확통", "G/평면", "고전", "F/생Ⅱ", "영독", "D/인간", "창A"]
      },
      "10": {
        date: "3월 6일 수요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["고전", "G/일문", "화작", "F/일회", "영독", "D/인공", "창A"]
      }
    }
  },
  "20240307": {
    "1": {
      "1": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["수학", "음악", "음악", "정보", "국어", "국사", "실험"]
      },
      "2": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["통사", "국어", "정보", "영어", "수학", "통과", "진로"]
      },
      "3": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["통과", "수학", "국어", "통사", "실험", "정보", "음악"]
      },
      "4": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["국사", "영어", "통사", "수학", "국사", "정보", "통과"]
      },
      "5": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["영어", "실험", "국사", "통과", "수학", "체육", "정보"]
      },
      "6": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["국사", "수학", "국어", "진로", "한문", "통사", "영어"]
      },
      "7": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["국어", "한문", "미술", "미술", "영어", "국사", "수학"]
      },
      "8": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["통과", "진로", "실험", "수학", "통사", "미술", "영어"]
      },
      "9": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["미술", "국어", "통과", "수학", "국사", "한문", "통사"]
      },
      "10": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["영어", "통과", "한문", "국사", "진로", "국어", "체육"]
      },
      "11": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["실험", "체육", "수학", "영어", "국어", "통과", "국사"]
      }
    },
    "2": {
      "1": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["진로", "영Ⅰ", "수Ⅰ", "A/윤사", "일Ⅰ", "문학", "운건"]
      },
      "2": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["영Ⅰ", "수Ⅰ", "N/일Ⅰ", "A/한지", "문학", "Q/미창", "Q/미창"]
      },
      "3": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["수Ⅰ", "운건", "문학", "A/세계", "영Ⅰ", "O/일Ⅰ", "영Ⅰ"]
      },
      "4": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["운건", "문학", "영Ⅰ", "A/윤사", "수Ⅰ", "K/가정", "일Ⅰ"]
      },
      "5": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["J/기하", "수Ⅰ", "영Ⅰ", "A/정법", "문학", "Q/음연", "Q/음연"]
      },
      "6": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["J/현대", "영Ⅰ", "수Ⅰ", "A/생과", "운건", "영Ⅰ", "문학"]
      },
      "7": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["문학", "L/현대", "운건", "A/생과", "영Ⅰ", "O/중Ⅰ", "수Ⅰ"]
      },
      "8": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["문학", "L/기하", "N/중Ⅰ", "A/생Ⅰ", "수Ⅰ", "영Ⅰ", "진로"]
      },
      "9": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["진로", "영Ⅰ", "일Ⅰ", "A/화Ⅰ", "M/현대", "문학", "수Ⅰ"]
      },
      "10": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["수Ⅰ", "문학", "진로", "A/지Ⅰ", "M/기하", "운건", "영Ⅰ"]
      },
      "11": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["영Ⅰ", "한지", "미창", "미창", "수Ⅰ", "K/현대", "문학"]
      }
    },
    "3": {
      "1": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/합주", "E/생Ⅱ", "X/영미", "U/언매", "F/여지", "스포", "D/생윤"]
      },
      "2": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/생Ⅱ", "E/생윤", "X/미적", "U/화작", "F/인간", "영독", "D/사문"]
      },
      "3": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/여지", "E/인공", "X/고전", "영독", "F/사문", "화작", "D/사탐"]
      },
      "4": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/일문", "E/경제", "확통", "스포", "F/생윤", "언매", "D/여지"]
      },
      "5": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/융과", "E/동아", "영독", "진로", "F/사탐", "확통", "D/일회"]
      },
      "6": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/사탐", "E/융과", "언매", "스포", "F/화Ⅱ", "영독", "D/중회"]
      },
      "7": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/인공", "E/사탐", "확통", "화작", "F/지Ⅱ", "Z/미적", "D/화Ⅱ"]
      },
      "8": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/사문", "E/여지", "화작", "영독", "F/프로", "Z/고전", "D/물Ⅱ"]
      },
      "9": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/세지", "E/일회", "스포", "시민", "F/생Ⅱ", "확통", "D/인간"]
      },
      "10": {
        date: "3월 7일 목요일",
        period: ["1", "2", "3", "4", "5", "6", "7"],
        subject: ["H/생윤", "E/인간", "영독", "확통", "F/일회", "진로", "D/인공"]
      }
    }
  },
  "20240308": {
    "1": {
      "1": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["수학", "영어", "정보", "통사", "통과"]
      },
      "2": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["국사", "음악", "통과", "국어", "통사"]
      },
      "3": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["국어", "통사", "수학", "국사", "체육"]
      },
      "4": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["진로", "국어", "국사", "체육", "수학"]
      },
      "5": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["통사", "체육", "음악", "음악", "국어"]
      },
      "6": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["통과", "국어", "수학", "실험", "통과"]
      },
      "7": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["미술", "통과", "통사", "국어", "수학"]
      },
      "8": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["국어", "수학", "국사", "체육", "한문"]
      },
      "9": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["수학", "국어", "미술", "미술", "영어"]
      },
      "10": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["실험", "수학", "통사", "국사", "통과"]
      },
      "11": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["통과", "한문", "수학", "국어", "미술"]
      }
    },
    "2": {
      "1": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["I/프로", "수Ⅰ", "C/화Ⅰ", "B/한지", "문학"]
      },
      "2": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["I/가정", "영Ⅰ", "C/윤사", "B/지Ⅰ", "운건"]
      },
      "3": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["I/심영", "문학", "C/윤사", "B/생과", "수Ⅰ"]
      },
      "4": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["수Ⅰ", "운건", "C/정법", "B/세계", "영Ⅰ"]
      },
      "5": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["문학", "수Ⅰ", "C/세계", "B/생과", "진로"]
      },
      "6": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["수Ⅰ", "일Ⅰ", "C/생Ⅰ", "B/윤사", "문학"]
      },
      "7": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["영Ⅰ", "문학", "C/생Ⅰ", "B/물Ⅰ", "수Ⅰ"]
      },
      "8": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["운건", "영Ⅰ", "C/지Ⅰ", "B/화Ⅰ", "문학"]
      },
      "9": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["T/음연", "T/음연", "C/물Ⅰ", "B/생Ⅰ", "영Ⅰ"]
      },
      "10": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["T/미창", "T/미창", "C/한지", "B/생Ⅰ", "수Ⅰ"]
      },
      "11": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["진로", "문학", "C/생과", "B/윤사", "일Ⅰ"]
      }
    },
    "3": {
      "1": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["진로", "D/생윤", "확통", "영미", "G/영문"]
      },
      "2": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["확통", "D/사문", "영독", "화작", "G/수탐"]
      },
      "3": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["영독", "D/사탐", "스포", "확통", "G/프로"]
      },
      "4": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["스포", "D/여지", "Y/영미", "시민", "G/사문"]
      },
      "5": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["화작", "D/일회", "Y/미적", "스포", "G/가정"]
      },
      "6": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["확통", "D/중회", "Y/고전", "영독", "G/생윤"]
      },
      "7": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["시민", "D/화Ⅱ", "영독", "화작", "G/합주"]
      },
      "8": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["영독", "D/물Ⅱ", "확통", "스포", "G/사탐"]
      },
      "9": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["고전", "D/인간", "진로", "언매", "G/평면"]
      },
      "10": {
        date: "3월 8일 금요일",
        period: ["1", "2", "3", "4", "5"],
        subject: ["스포", "D/인공", "고전", "확통", "G/일문"]
      }
    }
  }
};